zhengjy926/bsp/stm32/hal/bsp_usart.c
/**
  ******************************************************************************
  * @copyright   : Copyright To Hangzhou Dinova EP Technology Co.,Ltd
  * @file        : bsp_usart.c
  * @author      : ZJY
  * @version     : V1.0
  * @date        : 2025-10-16
  * @brief       : STM32 USART driver implementation
  * @attention   : None
  ******************************************************************************
  * @history     :
  *         V1.0 : 1.Initial version
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "bsp_usart.h"
#include "bsp_conf.h"
#include "bsp_dma.h"
#include "serial.h"
#include "errno-base.h"
#include <stdio.h>

#define  LOG_TAG             "bsp_uart"
#define  LOG_LVL             4
#include "log.h"

#if defined(HAL_UART_MODULE_ENABLED)

/* Private typedef -----------------------------------------------------------*/
struct stm32_uart {
    UART_HandleTypeDef huart;
    USART_TypeDef *Instance;
    DMA_HandleTypeDef hdma_uart_rx;
    DMA_HandleTypeDef hdma_uart_tx;
    char *name;
    uint8_t *rx_dma_buf;
    uint16_t rx_dma_bufsz;
    uint16_t last_pos;
    uint8_t *rx_it_buf;  /* 中断模式单字节接收缓冲区 */
    uint8_t index;
};

/* Private define ------------------------------------------------------------*/
enum
{
#ifdef BSP_USING_UART1
    UART1_INDEX,
#endif

#ifdef BSP_USING_UART2
    UART2_INDEX,
#endif

#ifdef BSP_USING_UART3
    UART3_INDEX,
#endif

#ifdef BSP_USING_UART4
    UART4_INDEX,
#endif

#ifdef BSP_USING_UART5
    UART5_INDEX,
#endif

#ifdef BSP_USING_UART6
    UART6_INDEX,
#endif

#ifdef BSP_USING_UART7
    UART7_INDEX,
#endif

#ifdef BSP_USING_UART8
    UART8_INDEX,
#endif

#ifdef BSP_USING_LPUART1
    LPUART1_INDEX,
#endif
    UART_INDEX_MAX,
};

/* Private variables ---------------------------------------------------------*/
static serial_t serial_dev[UART_INDEX_MAX]; /* 串口设备数组 */

/* 串口缓冲区定义 */
#if defined(BSP_USING_UART1)
    static uint8_t uart1_rx_buf[UART1_RX_BUF_SIZE]         = {0};
    static uint8_t uart1_tx_buf[UART1_TX_BUF_SIZE]         = {0};
#if defined(BSP_UART1_RX_USING_DMA)
    static uint8_t uart1_rx_dma_buf[UART1_RX_DMA_BUF_SIZE] = {0};
#else
    static uint8_t uart1_rx_it_buf                         = 0;  /* 中断模式单字节接收缓冲区 */
#endif
#endif // BSP_USING_UART1

#if defined(BSP_USING_UART2)
    static uint8_t uart2_rx_buf[UART2_RX_BUF_SIZE]              = {0};
    static uint8_t uart2_tx_buf[UART2_TX_BUF_SIZE]              = {0};
#if defined(BSP_UART2_RX_USING_DMA)
    static uint8_t uart2_rx_dma_buf[UART2_RX_DMA_BUF_SIZE]     = {0};
#else
    static uint8_t uart2_rx_it_buf                         = {0};  /* 中断模式单字节接收缓冲区 */
#endif
#endif // BSP_USING_UART2

#if defined(BSP_USING_UART3)
    static uint8_t uart3_rx_buf[UART3_RX_BUF_SIZE]              = {0};
    static uint8_t uart3_tx_buf[UART3_TX_BUF_SIZE]              = {0};
#if defined(BSP_UART3_RX_USING_DMA)
    static uint8_t uart3_rx_dma_buf[UART3_RX_DMA_BUF_SIZE]     = {0};
#else
    static uint8_t uart3_rx_it_buf                         = {0};  /* 中断模式单字节接收缓冲区 */
#endif
#endif // BSP_USING_UART3

#if defined(BSP_USING_UART4)
    static uint8_t uart4_rx_buf[UART4_RX_BUF_SIZE]              = {0};
    static uint8_t uart4_tx_buf[UART4_TX_BUF_SIZE]              = {0};
#if defined(BSP_UART4_RX_USING_DMA)
    static uint8_t uart4_rx_dma_buf[UART4_RX_DMA_BUF_SIZE]     = {0};
#else
    static uint8_t uart4_rx_it_buf                         = {0};  /* 中断模式单字节接收缓冲区 */
#endif
#endif // BSP_USING_UART4

#if defined(BSP_USING_UART5)
    static uint8_t uart5_rx_buf[UART5_RX_BUF_SIZE]              = {0};
    static uint8_t uart5_tx_buf[UART5_TX_BUF_SIZE]              = {0};
#if defined(BSP_UART5_RX_USING_DMA)
    static uint8_t uart5_rx_dma_buf[UART5_RX_DMA_BUF_SIZE]     = {0};
#else
    static uint8_t uart5_rx_it_buf                         = {0};  /* 中断模式单字节接收缓冲区 */
#endif
#endif // BSP_USING_UART5

#if defined(BSP_USING_UART6)
    static uint8_t uart6_rx_buf[UART6_RX_BUF_SIZE]              = {0};
    static uint8_t uart6_tx_buf[UART6_TX_BUF_SIZE]              = {0};
#if defined(BSP_UART6_RX_USING_DMA)
    static uint8_t uart6_rx_dma_buf[UART6_RX_DMA_BUF_SIZE]     = {0};
#else
    static uint8_t uart6_rx_it_buf                         = {0};  /* 中断模式单字节接收缓冲区 */
#endif
#endif // BSP_USING_UART6

#if defined(BSP_USING_UART7)
    static uint8_t uart7_rx_buf[UART7_RX_BUF_SIZE]              = {0};
    static uint8_t uart7_tx_buf[UART7_TX_BUF_SIZE]              = {0};
#if defined(BSP_UART7_RX_USING_DMA)
    static uint8_t uart7_rx_dma_buf[UART7_RX_DMA_BUF_SIZE]     = {0};
#else
    static uint8_t uart7_rx_it_buf                         = {0};  /* 中断模式单字节接收缓冲区 */
#endif
#endif // BSP_USING_UART7

#if defined(BSP_USING_UART8)
    static uint8_t uart8_rx_buf[UART8_RX_BUF_SIZE]              = {0};
    static uint8_t uart8_tx_buf[UART8_TX_BUF_SIZE]              = {0};
#if defined(BSP_UART8_RX_USING_DMA)
    static uint8_t uart8_rx_dma_buf[UART8_RX_DMA_BUF_SIZE]     = {0};
#else
    static uint8_t uart8_rx_it_buf                         = {0};  /* 中断模式单字节接收缓冲区 */
#endif
#endif // BSP_USING_UART8

#if defined(BSP_USING_LPUART1)
    static uint8_t lpuart1_rx_buf[LPUART1_RX_BUF_SIZE]          = {0};
    static uint8_t lpuart1_tx_buf[LPUART1_TX_BUF_SIZE]          = {0};
#if defined(BSP_LPUART1_RX_USING_DMA)
    static uint8_t lpuart1_rx_dma_buf[LPUART1_RX_DMA_BUF_SIZE] = {0};
#else
    static uint8_t lpuart1_rx_it_buf                         = {0};  /* 中断模式单字节接收缓冲区 */
#endif
#endif // BSP_USING_LPUART1

/* 平台专有驱动结构体变量定义 */
static struct stm32_uart stm_uart_drv[UART_INDEX_MAX] =
{
#ifdef BSP_USING_UART1
    {
        .Instance = USART1,
#ifdef BSP_UART1_RX_USING_DMA
        .rx_dma_buf = uart1_rx_dma_buf,
        .rx_dma_bufsz = UART1_RX_DMA_BUF_SIZE,
#else
        .rx_dma_buf = NULL,
        .rx_dma_bufsz = 0U,
        .rx_it_buf = &uart1_rx_it_buf,
#endif
        .index = UART1_INDEX,
        .name = "uart1",
    },
#endif

