zhengjy926/bsp/stm32/hal/bsp_usart.c
#ifdef BSP_USING_UART2
    {
        .Instance = USART2,
#ifdef BSP_UART2_RX_USING_DMA
        .rx_dma_buf = uart2_rx_dma_buf,
        .rx_dma_bufsz = UART2_RX_DMA_BUF_SIZE,
#else
        .rx_dma_buf = NULL,
        .rx_dma_bufsz = 0U,
#endif
        .rx_it_buf = &uart2_rx_it_buf,
        .index = UART2_INDEX,
        .name = "uart2",
    },
#endif

#ifdef BSP_USING_UART3
    {
        .Instance = USART3,
#ifdef BSP_UART3_RX_USING_DMA
        .rx_dma_buf = uart3_rx_dma_buf,
        .rx_dma_bufsz = UART3_RX_DMA_BUF_SIZE,
#else
        .rx_dma_buf = NULL,
        .rx_dma_bufsz = 0U,
#endif
        .rx_it_buf = &uart3_rx_it_buf,
        .index = UART3_INDEX,
        .name = "uart3",
    },
#endif

#ifdef BSP_USING_UART4
    {
        .Instance = UART4,
#ifdef BSP_UART4_RX_USING_DMA
        .rx_dma_buf = uart4_rx_dma_buf,
        .rx_dma_bufsz = UART4_RX_DMA_BUF_SIZE,
#else
        .rx_dma_buf = NULL,
        .rx_dma_bufsz = 0U,
#endif
        .rx_it_buf = &uart4_rx_it_buf,
        .index = UART4_INDEX,
        .name = "uart4",
    },
#endif
#ifdef BSP_USING_UART5
    {
        .Instance = UART5,
#ifdef BSP_UART5_RX_USING_DMA
        .rx_dma_buf = uart5_rx_dma_buf,
        .rx_dma_bufsz = UART5_RX_DMA_BUF_SIZE,
#else
        .rx_dma_buf = NULL,
        .rx_dma_bufsz = 0U,
#endif
        .rx_it_buf = &uart5_rx_it_buf,
        .index = UART5_INDEX,
        .name = "uart5",
    },
#endif
#ifdef BSP_USING_UART6
    {
        .Instance = UART6,
#ifdef BSP_UART6_RX_USING_DMA
        .rx_dma_buf = uart6_rx_dma_buf,
        .rx_dma_bufsz = UART6_RX_DMA_BUF_SIZE,
#else
        .rx_dma_buf = NULL,
        .rx_dma_bufsz = 0U,
#endif
        .rx_it_buf = &uart6_rx_it_buf,
        .index = UART6_INDEX,
        .name = "uart6",
    },
#endif
#ifdef BSP_USING_UART7
    {
        .Instance = UART7,
#ifdef BSP_UART7_RX_USING_DMA
        .rx_dma_buf = uart7_rx_dma_buf,
        .rx_dma_bufsz = UART7_RX_DMA_BUF_SIZE,
#else
        .rx_dma_buf = NULL,
        .rx_dma_bufsz = 0U,
#endif
        .rx_it_buf = &uart7_rx_it_buf,
        .index = UART7_INDEX,
        .name = "uart7",
    },
#endif
#ifdef BSP_USING_UART8
    {
        .Instance = UART8,
#ifdef BSP_UART8_RX_USING_DMA
        .rx_dma_buf = uart8_rx_dma_buf,
        .rx_dma_bufsz = UART8_RX_DMA_BUF_SIZE,
#else
        .rx_dma_buf = NULL,
        .rx_dma_bufsz = 0U,
#endif
        .rx_it_buf = &uart8_rx_it_buf,
        .index = UART8_INDEX,
        .name = "uart8",
    },
#endif
#ifdef BSP_USING_LPUART1
    {
        .Instance = LPUART1,
#ifdef BSP_LPUART1_RX_USING_DMA
        .rx_dma_buf = lpuart1_rx_dma_buf,
        .rx_dma_bufsz = LPUART1_RX_DMA_BUF_SIZE,
#else
        .rx_dma_buf = NULL,
        .rx_dma_bufsz = 0U,
#endif
        .rx_it_buf = &lpuart1_rx_it_buf,
        .index = LPUART1_INDEX,
        .name = "lpuart1",
    },
#endif
};

/* Function prototypes */
static int stm32_usart_init(serial_t *port);
static int stm32_uart_tx(serial_t *port, const void *buf, size_t size);
static int stm32_uart_start_rx(serial_t *port);
static int stm32_uart_configure(serial_t *port, struct serial_configure *cfg);
static void stm32_uart_gpio_init(struct stm32_uart *uartHandle);
static void stm32_uart_dma_config(struct stm32_uart *uartHandle);
static bool stm32_uart_tx_is_busy(struct serial *port);

/* Serial operations structure */
static const serial_ops_t stm_uart_ops = {
    .init = stm32_usart_init,
    .send = stm32_uart_tx,
    .configure = stm32_uart_configure,
    .start_rx = stm32_uart_start_rx,
    .tx_is_busy = stm32_uart_tx_is_busy,
};

/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

/**
  * @brief  STM32 USART initialization function
  * @param  port: Pointer to serial device
  * @retval 0 on success, negative error code on failure
  */
static int stm32_usart_init(serial_t *port)
{
    struct stm32_uart *stm_uart = (struct stm32_uart *)port->prv_data;
    int ret = 0;

    stm32_uart_gpio_init(stm_uart);
    stm32_uart_dma_config(stm_uart);

    /* Initialize port configuration with default values */
    struct serial_configure cfg = SERIAL_CONFIG_DEFAULT;
    port->config = cfg;

    /* Configure UART handle */
    stm_uart->huart.Instance = stm_uart->Instance;
    stm_uart->huart.Init.Mode = UART_MODE_TX_RX;
    stm_uart->huart.Init.OverSampling = UART_OVERSAMPLING_16;
#if defined(STM32G4)
    stm_uart->huart.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    stm_uart->huart.Init.ClockPrescaler = UART_PRESCALER_DIV1;
    stm_uart->huart.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
#endif

    ret = stm32_uart_configure(port, &cfg);
    if (ret != 0)
        return ret;

#if defined(STM32G4)
    /* Configure FIFO thresholds for STM32G4 series */
    if (HAL_UARTEx_SetTxFifoThreshold(&stm_uart->huart, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK) {
        return -EIO;
    }
    if (HAL_UARTEx_SetRxFifoThreshold(&stm_uart->huart, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK) {
        return -EIO;
    }
    if (HAL_UARTEx_DisableFifoMode(&stm_uart->huart) != HAL_OK) {
        return -EIO;
    }
#endif
    stm32_uart_start_rx(port);
    return 0;
}

/**
  * @brief  Configure UART parameters
  * @param  port: Pointer to serial device
  * @param  cfg: Pointer to configuration structure
  * @retval 0 on success, negative error code on failure
  */
static int stm32_uart_configure(serial_t *port, struct serial_configure *cfg)
{
    struct stm32_uart *stm_uart = (struct stm32_uart *)port->prv_data;

    if (!port || !cfg || !stm_uart) {
        return -EINVAL;
    }

    /* Configure baud rate */
    stm_uart->huart.Init.BaudRate = cfg->baud_rate;

    /* Configure data bits */
    switch (cfg->data_bits) {
        case DATA_BITS_8:
            stm_uart->huart.Init.WordLength = UART_WORDLENGTH_8B;
            break;
        case DATA_BITS_9:
            stm_uart->huart.Init.WordLength = UART_WORDLENGTH_9B;
            break;
        default:
            return -EINVAL;
    }

