zhengjy926/bsp/stm32/hal/bsp_usart.c
    /* Configure stop bits */
    switch (cfg->stop_bits) {
        case STOP_BITS_1:
            stm_uart->huart.Init.StopBits = UART_STOPBITS_1;
            break;
        case STOP_BITS_2:
            stm_uart->huart.Init.StopBits = UART_STOPBITS_2;
            break;
        default:
            return -EINVAL;
    }

    /* Configure parity */
    switch (cfg->parity) {
        case PARITY_NONE:
            stm_uart->huart.Init.Parity = UART_PARITY_NONE;
            break;
        case PARITY_ODD:
            stm_uart->huart.Init.Parity = UART_PARITY_ODD;
            break;
        case PARITY_EVEN:
            stm_uart->huart.Init.Parity = UART_PARITY_EVEN;
            break;
        default:
            return -EINVAL;
    }

    /* Configure flow control */
    if (cfg->flowcontrol == SERIAL_FLOWCONTROL_CTSRTS) {
        stm_uart->huart.Init.HwFlowCtl = UART_HWCONTROL_RTS_CTS;
    } else {
        stm_uart->huart.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    }

    /* Apply configuration */
    if (HAL_UART_Init(&stm_uart->huart) != HAL_OK) {
        return -EIO;
    }

    return 0;
}

static inline void stm32_uart_rx_dma_config(struct stm32_uart *uartHandle)
{
    /* DMA RX配置 */
    uartHandle->hdma_uart_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
    uartHandle->hdma_uart_rx.Init.PeriphInc = DMA_PINC_DISABLE;
    uartHandle->hdma_uart_rx.Init.MemInc = DMA_MINC_ENABLE;
    uartHandle->hdma_uart_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    uartHandle->hdma_uart_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    uartHandle->hdma_uart_rx.Init.Mode = DMA_NORMAL;
    uartHandle->hdma_uart_rx.Init.Priority = DMA_PRIORITY_VERY_HIGH;

    if (HAL_DMA_Init(&uartHandle->hdma_uart_rx) != HAL_OK) {
        LOG_E("HAL_DMA_Init errno");
        while(1);
    }
    __HAL_LINKDMA(&uartHandle->huart, hdmarx, uartHandle->hdma_uart_rx);
}

static inline void stm32_uart_tx_dma_config(struct stm32_uart *uartHandle)
{
    /* DMA TX配置 */
    uartHandle->hdma_uart_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
    uartHandle->hdma_uart_tx.Init.PeriphInc = DMA_PINC_DISABLE;
    uartHandle->hdma_uart_tx.Init.MemInc = DMA_MINC_ENABLE;
    uartHandle->hdma_uart_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    uartHandle->hdma_uart_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    uartHandle->hdma_uart_tx.Init.Mode = DMA_NORMAL;
    uartHandle->hdma_uart_tx.Init.Priority = DMA_PRIORITY_VERY_HIGH;

    if (HAL_DMA_Init(&uartHandle->hdma_uart_tx) != HAL_OK) {
        LOG_E("HAL_DMA_Init errno");
        while(1);
    }
    __HAL_LINKDMA(&uartHandle->huart, hdmatx, uartHandle->hdma_uart_tx);
}

/**
 * @brief 配置DMA
 * @param uartHandle: UART句柄
 * @param uart_index: UART索引
 * @retval None
 */
static void stm32_uart_dma_config(struct stm32_uart *uartHandle)
{
    /* DMA controller clock enable */
#if defined(STM32G4) || defined(STM32H7)
    __HAL_RCC_DMAMUX1_CLK_ENABLE();
#endif
    __HAL_RCC_DMA1_CLK_ENABLE();
    __HAL_RCC_DMA2_CLK_ENABLE();

    switch (uartHandle->index) {
#ifdef BSP_USING_UART1
    case UART1_INDEX:
#ifdef BSP_UART1_RX_USING_DMA
        uartHandle->hdma_uart_rx.Instance = BSP_UART1_DMA_RX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_rx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_rx.Init.Request = DMA_REQUEST_USART1_RX;
#endif
        stm32_uart_rx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART1_DMA_RX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART1_DMA_RX_IRQn);
#endif
#ifdef BSP_UART1_TX_USING_DMA
        uartHandle->hdma_uart_tx.Instance = BSP_UART1_DMA_TX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_tx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_tx.Init.Request = DMA_REQUEST_USART1_TX;
#endif
        stm32_uart_tx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART1_DMA_TX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART1_DMA_TX_IRQn);
#endif
        break;
#endif

#ifdef BSP_USING_UART2
    case UART2_INDEX:
#ifdef BSP_UART2_RX_USING_DMA
        uartHandle->hdma_uart_rx.Instance = BSP_UART2_DMA_RX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_rx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_rx.Init.Request = DMA_REQUEST_USART2_RX;
#endif
        stm32_uart_rx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART2_DMA_RX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART2_DMA_RX_IRQn);
#endif
#ifdef BSP_UART2_TX_USING_DMA
        uartHandle->hdma_uart_tx.Instance = BSP_UART2_DMA_TX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_tx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_tx.Init.Request = DMA_REQUEST_USART2_TX;
#endif
        stm32_uart_tx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART2_DMA_TX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART2_DMA_TX_IRQn);
#endif
        break;
#endif

#ifdef BSP_USING_UART3
    case UART3_INDEX:
#ifdef BSP_UART3_RX_USING_DMA
        uartHandle->hdma_uart_rx.Instance = BSP_UART3_DMA_RX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_rx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_rx.Init.Request = DMA_REQUEST_USART3_RX;
#endif
        stm32_uart_rx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART3_DMA_RX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART3_DMA_RX_IRQn);
#endif
#ifdef BSP_UART3_TX_USING_DMA
        uartHandle->hdma_uart_tx.Instance = BSP_UART3_DMA_TX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_tx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_tx.Init.Request = DMA_REQUEST_USART3_TX;
#endif
        stm32_uart_tx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART3_DMA_TX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART3_DMA_TX_IRQn);
#endif
        break;
#endif

#ifdef BSP_USING_UART4
    case UART4_INDEX:
#ifdef BSP_UART4_RX_USING_DMA
        uartHandle->hdma_uart_rx.Instance = BSP_UART4_DMA_RX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_rx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_rx.Init.Request = DMA_REQUEST_UART4_RX;
#endif
        stm32_uart_rx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART4_DMA_RX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART4_DMA_RX_IRQn);
#endif
#ifdef BSP_UART4_TX_USING_DMA
        uartHandle->hdma_uart_tx.Instance = BSP_UART4_DMA_TX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_tx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_tx.Init.Request = DMA_REQUEST_UART4_TX;
#endif
        stm32_uart_tx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART4_DMA_TX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART4_DMA_TX_IRQn);
#endif
        break;
#endif

#ifdef BSP_USING_UART5
    case UART5_INDEX:
#ifdef BSP_UART5_RX_USING_DMA
        uartHandle->hdma_uart_rx.Instance = BSP_UART5_DMA_RX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_rx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_rx.Init.Request = DMA_REQUEST_UART5_RX;
#endif
        stm32_uart_rx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART5_DMA_RX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART5_DMA_RX_IRQn);
#endif
#ifdef BSP_UART5_TX_USING_DMA
        uartHandle->hdma_uart_tx.Instance = BSP_UART5_DMA_TX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_tx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_tx.Init.Request = DMA_REQUEST_UART5_TX;
#endif
        stm32_uart_tx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART5_DMA_TX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART5_DMA_TX_IRQn);
#endif
        break;
#endif

#ifdef BSP_USING_UART6
    case UART6_INDEX:
#ifdef BSP_UART6_RX_USING_DMA
        uartHandle->hdma_uart_rx.Instance = BSP_UART6_DMA_RX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_rx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_rx.Init.Request = DMA_REQUEST_USART6_RX;
#endif
        stm32_uart_rx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART6_DMA_RX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART6_DMA_RX_IRQn);
#endif
#ifdef BSP_UART6_TX_USING_DMA
        uartHandle->hdma_uart_tx.Instance = BSP_UART6_DMA_TX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_tx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_tx.Init.Request = DMA_REQUEST_USART6_TX;
#endif
        stm32_uart_tx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART6_DMA_TX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART6_DMA_TX_IRQn);
#endif
        break;
#endif

#ifdef BSP_USING_UART7
    case UART7_INDEX:
#ifdef BSP_UART7_RX_USING_DMA
        uartHandle->hdma_uart_rx.Instance = BSP_UART7_DMA_RX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_rx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_rx.Init.Request = DMA_REQUEST_UART7_RX;
#endif
        stm32_uart_rx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART7_DMA_RX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART7_DMA_RX_IRQn);
#endif
#ifdef BSP_UART7_TX_USING_DMA
        uartHandle->hdma_uart_tx.Instance = BSP_UART7_DMA_TX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_tx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_tx.Init.Request = DMA_REQUEST_UART7_TX;
#endif
        stm32_uart_tx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART7_DMA_TX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART7_DMA_TX_IRQn);
#endif
        break;
#endif

#ifdef BSP_USING_UART8
    case UART8_INDEX:
#ifdef BSP_UART8_RX_USING_DMA
        uartHandle->hdma_uart_rx.Instance = BSP_UART8_DMA_RX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_rx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_rx.Init.Request = DMA_REQUEST_UART8_RX;
#endif
        stm32_uart_rx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART8_DMA_RX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART8_DMA_RX_IRQn);
#endif
#ifdef BSP_UART8_TX_USING_DMA
        uartHandle->hdma_uart_tx.Instance = BSP_UART8_DMA_TX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_tx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_tx.Init.Request = DMA_REQUEST_UART8_TX;
#endif
        stm32_uart_tx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_UART8_DMA_TX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_UART8_DMA_TX_IRQn);
#endif
        break;
#endif

#ifdef BSP_USING_LPUART1
    case LPUART1_INDEX:
#ifdef BSP_LPUART1_RX_USING_DMA
        uartHandle->hdma_uart_rx.Instance = BSP_LPUART1_DMA_RX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_rx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_rx.Init.Request = DMA_REQUEST_LPUART1_RX;
#endif
        stm32_uart_rx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_LPUART1_DMA_RX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_LPUART1_DMA_RX_IRQn);
#endif
#ifdef BSP_LPUART1_TX_USING_DMA
        uartHandle->hdma_uart_tx.Instance = BSP_LPUART1_DMA_TX_INSTANCE;
#if defined(STM32F4)
        uartHandle->hdma_uart_tx.Init.Channel = DMA_CHANNEL_4;
#elif defined(STM32G4) || defined(STM32H7)
        uartHandle->hdma_uart_tx.Init.Request = DMA_REQUEST_LPUART1_TX;
#endif
        stm32_uart_tx_dma_config(uartHandle);
        HAL_NVIC_SetPriority(BSP_LPUART1_DMA_TX_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(BSP_LPUART1_DMA_TX_IRQn);
#endif
        break;
#endif
    default:
        return;
    }
}

/**
  * @brief  Initialize UART GPIO pins
  * @param  uartHandle: Pointer to UART handle structure
  * @retval None
  */
static void stm32_uart_gpio_init(struct stm32_uart *uartHandle)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};
#if defined(STM32G4)
    RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
#endif

    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;

