zhengjy926/bsp/stm32/hal/bsp_usart.c
    switch (uartHandle->index) {
#ifdef BSP_USING_UART1
    case UART1_INDEX:
#if defined(STM32G4)
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1;
        PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
        {
            LOG_E("HAL_RCCEx_PeriphCLKConfig errno");
            while(1);
        }
#endif
        __HAL_RCC_USART1_CLK_ENABLE();
    
#if defined(STM32F4) || defined(STM32G4) || defined(STM32H7)
        GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
#endif
        GPIO_InitStruct.Pin = BSP_UART1_TX_PIN;
        HAL_GPIO_Init(BSP_UART1_TX_PORT, &GPIO_InitStruct);
        GPIO_InitStruct.Pin = BSP_UART1_RX_PIN;
        HAL_GPIO_Init(BSP_UART1_RX_PORT, &GPIO_InitStruct);
        HAL_NVIC_SetPriority(USART1_IRQn, 0, BSP_UART1_IRQ_PRIORITY);
        HAL_NVIC_EnableIRQ(USART1_IRQn);
        break;
#endif

#ifdef BSP_USING_UART2
    case UART2_INDEX:
#if defined(STM32G4)
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART2;
        PeriphClkInit.Usart2ClockSelection = RCC_USART2CLKSOURCE_PCLK1;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
        {
            LOG_E("HAL_RCCEx_PeriphCLKConfig errno");
            while(1);
        }
#endif
        __HAL_RCC_USART2_CLK_ENABLE();

#if defined(STM32F4) || defined(STM32G4) || defined(STM32H7)
        GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
#endif
        GPIO_InitStruct.Pin = BSP_UART2_TX_PIN;
        HAL_GPIO_Init(BSP_UART2_TX_PORT, &GPIO_InitStruct);
        GPIO_InitStruct.Pin = BSP_UART2_RX_PIN;
        HAL_GPIO_Init(BSP_UART2_RX_PORT, &GPIO_InitStruct);
        HAL_NVIC_SetPriority(USART2_IRQn, 0, BSP_UART2_IRQ_PRIORITY);
        HAL_NVIC_EnableIRQ(USART2_IRQn);
        break;
#endif

#ifdef BSP_USING_UART3
    case UART3_INDEX:
#if defined(STM32G4)
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART3;
        PeriphClkInit.Usart3ClockSelection = RCC_USART3CLKSOURCE_PCLK1;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
        {
            LOG_E("HAL_RCCEx_PeriphCLKConfig errno");
            while(1);
        }
#endif
        __HAL_RCC_USART3_CLK_ENABLE();

#if defined(STM32F4) || defined(STM32G4) || defined(STM32H7)
        GPIO_InitStruct.Alternate = GPIO_AF7_USART3;
#endif
        GPIO_InitStruct.Pin = BSP_UART3_TX_PIN;
        HAL_GPIO_Init(BSP_UART3_TX_PORT, &GPIO_InitStruct);
        GPIO_InitStruct.Pin = BSP_UART3_RX_PIN;
        HAL_GPIO_Init(BSP_UART3_RX_PORT, &GPIO_InitStruct);
        HAL_NVIC_SetPriority(USART3_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(USART3_IRQn);
        break;
#endif

#ifdef BSP_USING_UART4
    case UART4_INDEX:
#if defined(STM32G4)
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_UART4;
        PeriphClkInit.Uart4ClockSelection = RCC_UART4CLKSOURCE_PCLK1;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
        {
            LOG_E("HAL_RCCEx_PeriphCLKConfig errno");
            while(1);
        }
#endif
        __HAL_RCC_UART4_CLK_ENABLE();

#if defined(STM32F4) || defined(STM32G4) || defined(STM32H7)
        GPIO_InitStruct.Alternate = GPIO_AF8_UART4;
#endif
        GPIO_InitStruct.Pin = BSP_UART4_TX_PIN;
        HAL_GPIO_Init(BSP_UART4_TX_PORT, &GPIO_InitStruct);
        GPIO_InitStruct.Pin = BSP_UART4_RX_PIN;
        HAL_GPIO_Init(BSP_UART4_RX_PORT, &GPIO_InitStruct);
        HAL_NVIC_SetPriority(UART4_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(UART4_IRQn);
        break;
#endif

#ifdef BSP_USING_UART5
    case UART5_INDEX:
#if defined(STM32G4)
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_UART5;
        PeriphClkInit.Uart5ClockSelection = RCC_UART5CLKSOURCE_PCLK1;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
        {
            LOG_E("HAL_RCCEx_PeriphCLKConfig errno");
            while(1);
        }
#endif
        __HAL_RCC_UART5_CLK_ENABLE();

#if defined(STM32F4) || defined(STM32G4) || defined(STM32H7)
        GPIO_InitStruct.Alternate = GPIO_AF8_UART5;
#endif
        GPIO_InitStruct.Pin = BSP_UART5_TX_PIN;
        HAL_GPIO_Init(BSP_UART5_TX_PORT, &GPIO_InitStruct);
        GPIO_InitStruct.Pin = BSP_UART5_RX_PIN;
        HAL_GPIO_Init(BSP_UART5_RX_PORT, &GPIO_InitStruct);
        HAL_NVIC_SetPriority(UART5_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(UART5_IRQn);
        break;
#endif

#ifdef BSP_USING_UART6
    case UART6_INDEX:
#if defined(STM32G4)
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART6;
        PeriphClkInit.Usart6ClockSelection = RCC_USART6CLKSOURCE_PCLK2;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
        {
            LOG_E("HAL_RCCEx_PeriphCLKConfig errno");
            while(1);
        }
#endif
        __HAL_RCC_USART6_CLK_ENABLE();

#if defined(STM32F4) || defined(STM32G4) || defined(STM32H7)
        GPIO_InitStruct.Alternate = GPIO_AF8_USART6;
#endif
        GPIO_InitStruct.Pin = BSP_UART6_TX_PIN;
        HAL_GPIO_Init(BSP_UART6_TX_PORT, &GPIO_InitStruct);
        GPIO_InitStruct.Pin = BSP_UART6_RX_PIN;
        HAL_GPIO_Init(BSP_UART6_RX_PORT, &GPIO_InitStruct);
        HAL_NVIC_SetPriority(USART6_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(USART6_IRQn);
        break;
#endif

#ifdef BSP_USING_UART7
    case UART7_INDEX:
#if defined(STM32G4)
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_UART7;
        PeriphClkInit.Uart7ClockSelection = RCC_UART7CLKSOURCE_PCLK1;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
        {
            LOG_E("HAL_RCCEx_PeriphCLKConfig errno");
            while(1);
        }
#endif
        __HAL_RCC_UART7_CLK_ENABLE();

#if defined(STM32F4) || defined(STM32G4) || defined(STM32H7)
        GPIO_InitStruct.Alternate = GPIO_AF8_UART7;
#endif
        GPIO_InitStruct.Pin = BSP_UART7_TX_PIN;
        HAL_GPIO_Init(BSP_UART7_TX_PORT, &GPIO_InitStruct);
        GPIO_InitStruct.Pin = BSP_UART7_RX_PIN;
        HAL_GPIO_Init(BSP_UART7_RX_PORT, &GPIO_InitStruct);
        HAL_NVIC_SetPriority(UART7_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(UART7_IRQn);
        break;
#endif

#ifdef BSP_USING_UART8
    case UART8_INDEX:
#if defined(STM32G4)
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_UART8;
        PeriphClkInit.Uart8ClockSelection = RCC_UART8CLKSOURCE_PCLK1;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
        {
            LOG_E("HAL_RCCEx_PeriphCLKConfig errno");
            while(1);
        }
#endif
        __HAL_RCC_UART8_CLK_ENABLE();

#if defined(STM32F4) || defined(STM32G4) || defined(STM32H7)
        GPIO_InitStruct.Alternate = GPIO_AF8_UART8;
#endif
        GPIO_InitStruct.Pin = BSP_UART8_TX_PIN;
        HAL_GPIO_Init(BSP_UART8_TX_PORT, &GPIO_InitStruct);
        GPIO_InitStruct.Pin = BSP_UART8_RX_PIN;
        HAL_GPIO_Init(BSP_UART8_RX_PORT, &GPIO_InitStruct);
        HAL_NVIC_SetPriority(UART8_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(UART8_IRQn);
        break;
#endif

#ifdef BSP_USING_LPUART1
    case LPUART1_INDEX:
#if defined(STM32G4)
        PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_LPUART1;
        PeriphClkInit.Lpuart1ClockSelection = RCC_LPUART1CLKSOURCE_PCLK1;
        if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
        {
            LOG_E("HAL_RCCEx_PeriphCLKConfig errno");
            while(1);
        }
#endif
        __HAL_RCC_LPUART1_CLK_ENABLE();

#if defined(STM32F4) || defined(STM32G4) || defined(STM32H7)
        GPIO_InitStruct.Alternate = GPIO_AF8_LPUART1;
#endif
        GPIO_InitStruct.Pin = BSP_LPUART1_TX_PIN;
        HAL_GPIO_Init(BSP_LPUART1_TX_PORT, &GPIO_InitStruct);
        GPIO_InitStruct.Pin = BSP_LPUART1_RX_PIN;
        HAL_GPIO_Init(BSP_LPUART1_RX_PORT, &GPIO_InitStruct);
        HAL_NVIC_SetPriority(LPUART1_IRQn, 0, 0);
        HAL_NVIC_EnableIRQ(LPUART1_IRQn);
        break;
#endif
    default:
        return;
    }
}

