zhengjy926/bsp/stm32/hal/bsp_usart.c
static bool stm32_uart_tx_is_busy(struct serial *port)
{
    struct stm32_uart *stm_uart = (struct stm32_uart *)port->prv_data;

    return (stm_uart->huart.gState == HAL_UART_STATE_BUSY_TX) ? true : false;
}

/**
  * @brief  UART transmit using DMA or interrupt mode
  * @param  port: Pointer to serial device
  * @param  buf: Pointer to data buffer
  * @param  size: Number of bytes to transmit
  * @retval 0 on success, negative error code on failure
  */
static int stm32_uart_tx(serial_t *port, const void *buf, size_t size)
{
    struct stm32_uart *stm_uart = (struct stm32_uart *)port->prv_data;
    HAL_StatusTypeDef status;
    const uint8_t *data = (const uint8_t*)buf;

    if (!port || !buf || size == 0 || !stm_uart) {
        return -EINVAL;
    }

    if (size > UINT16_MAX) {
        return -EINVAL;
    }

    if (stm_uart->huart.hdmatx != NULL) {
        status = HAL_UART_Transmit_DMA(&stm_uart->huart, data, (uint16_t)size);
    } else {
        status = HAL_UART_Transmit_IT(&stm_uart->huart, data, (uint16_t)size);
    }

    if (status != HAL_OK) {
        LOG_E("HAL_UART_Transmit_DMA/IT failed");
        return -EIO;
    }

    return 0;
}

/**
  * @brief  Start UART DMA/Interrupt reception
  * @param  port: Pointer to serial device
  * @retval 0 on success, negative error code on failure
  */
static int stm32_uart_start_rx(serial_t *port)
{
    struct stm32_uart *stm_uart = (struct stm32_uart *)port->prv_data;
    HAL_StatusTypeDef status;

    if (!port || !stm_uart) {
        return -EINVAL;
    }

    // 重置位置计数器
    stm_uart->last_pos = 0;

    // 重新开启中断接收
    if (stm_uart->huart.hdmarx != NULL) {
        /* 使用DMA模式接收 */
        status = HAL_UARTEx_ReceiveToIdle_DMA(&stm_uart->huart,
                                             stm_uart->rx_dma_buf,
                                             stm_uart->rx_dma_bufsz);
    } else {
        /* 使用中断模式接收，单字节接收 */
        if (stm_uart->rx_it_buf == NULL) {
            LOG_E("rx_it_buf is NULL");
            return -EINVAL;
        }
        status = HAL_UART_Receive_IT(&stm_uart->huart, stm_uart->rx_it_buf, 1);
    }

    if (status != HAL_OK) {
        LOG_E("HAL_UART_Receive_DMA/IT failed");
        return -EIO;
    }

    return 0;
}

/**
  * @brief  Initialize STM32 USART hardware
  * @retval 0 on success, negative error code on failure
  */
int bsp_uart_init(void)
{
    int ret = 0;

    for (uint8_t i = 0; i < UART_INDEX_MAX; i++)
    {
        serial_dev[i].prv_data = &stm_uart_drv[i];
        serial_dev[i].ops = &stm_uart_ops;

        ret = hw_serial_register(&serial_dev[i], stm_uart_drv[i].name);
        if (ret != 0) {
            return ret;
        }
    }

#if defined(BSP_USING_UART1)
#if defined(BSP_UART1_RX_USING_DMA)
    stm_uart_drv[UART1_INDEX].rx_dma_buf = uart1_rx_dma_buf;
    stm_uart_drv[UART1_INDEX].rx_dma_bufsz = sizeof(uart1_rx_dma_buf);
#endif
    serial_dev[UART1_INDEX].rx_buf   = uart1_rx_buf;
    serial_dev[UART1_INDEX].rx_bufsz = sizeof(uart1_rx_buf);
    serial_dev[UART1_INDEX].tx_buf   = uart1_tx_buf;
    serial_dev[UART1_INDEX].tx_bufsz = sizeof(uart1_tx_buf);
#endif

#if defined(BSP_USING_UART2)
#if defined(BSP_UART2_RX_USING_DMA)
    stm_uart_drv[UART2_INDEX].rx_dma_buf = uart2_rx_dma_buf;
    stm_uart_drv[UART2_INDEX].rx_dma_bufsz = sizeof(uart2_rx_dma_buf);
#endif
    serial_dev[UART2_INDEX].rx_buf   = uart2_rx_buf;
    serial_dev[UART2_INDEX].rx_bufsz = sizeof(uart2_rx_buf);
    serial_dev[UART2_INDEX].tx_buf   = uart2_tx_buf;
    serial_dev[UART2_INDEX].tx_bufsz = sizeof(uart2_tx_buf);
#endif

#if defined(BSP_USING_UART3)
#if defined(BSP_UART3_RX_USING_DMA)
    stm_uart_drv[UART3_INDEX].rx_dma_buf = uart3_rx_dma_buf;
    stm_uart_drv[UART3_INDEX].rx_dma_bufsz = sizeof(uart3_rx_dma_buf);
#endif
    serial_dev[UART3_INDEX].rx_buf   = uart3_rx_buf;
    serial_dev[UART3_INDEX].rx_bufsz = sizeof(uart3_rx_buf);
    serial_dev[UART3_INDEX].tx_buf   = uart3_tx_buf;
    serial_dev[UART3_INDEX].tx_bufsz = sizeof(uart3_tx_buf);
#endif

#if defined(BSP_USING_UART4)
#if defined(BSP_UART4_RX_USING_DMA)
    stm_uart_drv[UART4_INDEX].rx_dma_buf = uart4_rx_dma_buf;
    stm_uart_drv[UART4_INDEX].rx_dma_bufsz = sizeof(uart4_rx_dma_buf);
#endif
    serial_dev[UART4_INDEX].rx_buf   = uart4_rx_buf;
    serial_dev[UART4_INDEX].rx_bufsz = sizeof(uart4_rx_buf);
    serial_dev[UART4_INDEX].tx_buf   = uart4_tx_buf;
    serial_dev[UART4_INDEX].tx_bufsz = sizeof(uart4_tx_buf);
#endif

#if defined(BSP_USING_UART5)
#if defined(BSP_UART5_RX_USING_DMA)
    stm_uart_drv[UART5_INDEX].rx_dma_buf = uart5_rx_dma_buf;
    stm_uart_drv[UART5_INDEX].rx_dma_bufsz = sizeof(uart5_rx_dma_buf);
#endif
    serial_dev[UART5_INDEX].rx_buf   = uart5_rx_buf;
    serial_dev[UART5_INDEX].rx_bufsz = sizeof(uart5_rx_buf);
    serial_dev[UART5_INDEX].tx_buf   = uart5_tx_buf;
    serial_dev[UART5_INDEX].tx_bufsz = sizeof(uart5_tx_buf);
#endif

#if defined(BSP_USING_UART6)
#if defined(BSP_UART6_RX_USING_DMA)
    stm_uart_drv[UART6_INDEX].rx_dma_buf = uart6_rx_dma_buf;
    stm_uart_drv[UART6_INDEX].rx_dma_bufsz = sizeof(uart6_rx_dma_buf);
#endif
    serial_dev[UART6_INDEX].rx_buf   = uart6_rx_buf;
    serial_dev[UART6_INDEX].rx_bufsz = sizeof(uart6_rx_buf);
    serial_dev[UART6_INDEX].tx_buf   = uart6_tx_buf;
    serial_dev[UART6_INDEX].tx_bufsz = sizeof(uart6_tx_buf);
#endif

#if defined(BSP_USING_UART7)
#if defined(BSP_UART7_RX_USING_DMA)
    stm_uart_drv[UART7_INDEX].rx_dma_buf = uart7_rx_dma_buf;
    stm_uart_drv[UART7_INDEX].rx_dma_bufsz = sizeof(uart7_rx_dma_buf);
#endif
    serial_dev[UART7_INDEX].rx_buf   = uart7_rx_buf;
    serial_dev[UART7_INDEX].rx_bufsz = sizeof(uart7_rx_buf);
    serial_dev[UART7_INDEX].tx_buf   = uart7_tx_buf;
    serial_dev[UART7_INDEX].tx_bufsz = sizeof(uart7_tx_buf);
#endif

#if defined(BSP_USING_UART8)
#if defined(BSP_UART8_RX_USING_DMA)
    stm_uart_drv[UART8_INDEX].rx_dma_buf = uart8_rx_dma_buf;
    stm_uart_drv[UART8_INDEX].rx_dma_bufsz = sizeof(uart8_rx_dma_buf);
#endif
    serial_dev[UART8_INDEX].rx_buf   = uart8_rx_buf;
    serial_dev[UART8_INDEX].rx_bufsz = sizeof(uart8_rx_buf);
    serial_dev[UART8_INDEX].tx_buf   = uart8_tx_buf;
    serial_dev[UART8_INDEX].tx_bufsz = sizeof(uart8_tx_buf);
#endif

